////////////////////////////////////////////////////////////////////
// 2024.10.16 수 910
//
//------------------------------------------------------------------
// 8주 2일 중간시험
// 앞으로 휴일이 있으면 쉬지않고 강의함 추석 예외
// -----------------------------------------------------------------
// STAC, DATA, FRE STORE, CODE
//------------------------------------------------------------------
// C++ 언어 - 메모리 이해가 필수입니다.
// FILE IO
// -----------------------------------------------------------------
	
#INCLUDE<IOSTREAM>//STRAM : 흘러가다
#INCLUDE<FSTREAM>
#INCLUDE"SAVE.H"
USING NAMESPACE STD;	

INT MAIN() {
	//[문제] "메인.CPP"에 있는 소문자를 모두 대문자로 바꾼 
	//"메인대문자.CPP를 만들어라.
    IFSTREAM IN("MAIN.CPP");      
    OFSTREAM OUT("메인대문자.CPP");

    IF (NOT IN) {
        CERR << "메인.CPP 파일을 열 수 없습니다." << ENDL;
        RETURN 1;
    }

    CHAR CH;

    IN >> NOSKIPWS;
    WHILE (IN >> CH) {
        CH = TOUPPER(CH);
        OUT << CH;   
    }
    COUT << "메인대문자.CPP 파일이 생성되었습니다." << ENDL;
    RETURN 0;




	SAVE("MAIN.CPP");
}